k6/home/result/stress.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 scenario, 69 max VUs, 2m0s max duration (incl. graceful stop):
           * default: Up to 69 looping VUs for 1m30s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 03/69 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 03/69 VUs  0m01.0s/1m30.0s

running (0m02.0s), 05/69 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 05/69 VUs  0m02.0s/1m30.0s

running (0m03.0s), 07/69 VUs, 8 complete and 0 interrupted iterations
default   [   3% ] 07/69 VUs  0m03.0s/1m30.0s

running (0m04.0s), 09/69 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 09/69 VUs  0m04.0s/1m30.0s

running (0m05.0s), 11/69 VUs, 23 complete and 0 interrupted iterations
default   [   6% ] 11/69 VUs  0m05.0s/1m30.0s

running (0m06.0s), 14/69 VUs, 34 complete and 0 interrupted iterations
default   [   7% ] 14/69 VUs  0m06.0s/1m30.0s

running (0m07.0s), 16/69 VUs, 48 complete and 0 interrupted iterations
default   [   8% ] 16/69 VUs  0m07.0s/1m30.0s

running (0m08.0s), 18/69 VUs, 64 complete and 0 interrupted iterations
default   [   9% ] 18/69 VUs  0m08.0s/1m30.0s

running (0m09.0s), 20/69 VUs, 81 complete and 0 interrupted iterations
default   [  10% ] 20/69 VUs  0m09.0s/1m30.0s

running (0m10.0s), 22/69 VUs, 100 complete and 0 interrupted iterations
default   [  11% ] 22/69 VUs  0m10.0s/1m30.0s

running (0m11.0s), 23/69 VUs, 121 complete and 0 interrupted iterations
default   [  12% ] 23/69 VUs  0m11.0s/1m30.0s

running (0m12.0s), 23/69 VUs, 144 complete and 0 interrupted iterations
default   [  13% ] 23/69 VUs  0m12.0s/1m30.0s

running (0m13.0s), 23/69 VUs, 167 complete and 0 interrupted iterations
default   [  14% ] 23/69 VUs  0m13.0s/1m30.0s

running (0m14.0s), 23/69 VUs, 190 complete and 0 interrupted iterations
default   [  16% ] 23/69 VUs  0m14.0s/1m30.0s

running (0m15.0s), 23/69 VUs, 212 complete and 0 interrupted iterations
default   [  17% ] 23/69 VUs  0m15.0s/1m30.0s

running (0m16.0s), 23/69 VUs, 235 complete and 0 interrupted iterations
default   [  18% ] 23/69 VUs  0m16.0s/1m30.0s

running (0m17.0s), 23/69 VUs, 258 complete and 0 interrupted iterations
default   [  19% ] 23/69 VUs  0m17.0s/1m30.0s

running (0m18.0s), 23/69 VUs, 281 complete and 0 interrupted iterations
default   [  20% ] 23/69 VUs  0m18.0s/1m30.0s

running (0m19.0s), 23/69 VUs, 302 complete and 0 interrupted iterations
default   [  21% ] 23/69 VUs  0m19.0s/1m30.0s

running (0m20.0s), 23/69 VUs, 325 complete and 0 interrupted iterations
default   [  22% ] 23/69 VUs  0m20.0s/1m30.0s

running (0m21.0s), 25/69 VUs, 345 complete and 0 interrupted iterations
default   [  23% ] 25/69 VUs  0m21.0s/1m30.0s

running (0m22.0s), 27/69 VUs, 369 complete and 0 interrupted iterations
default   [  24% ] 27/69 VUs  0m22.0s/1m30.0s

running (0m23.0s), 29/69 VUs, 396 complete and 0 interrupted iterations
default   [  26% ] 29/69 VUs  0m23.0s/1m30.0s

running (0m24.0s), 32/69 VUs, 425 complete and 0 interrupted iterations
default   [  27% ] 32/69 VUs  0m24.0s/1m30.0s

running (0m25.0s), 34/69 VUs, 457 complete and 0 interrupted iterations
default   [  28% ] 34/69 VUs  0m25.0s/1m30.0s

running (0m26.0s), 36/69 VUs, 491 complete and 0 interrupted iterations
default   [  29% ] 36/69 VUs  0m26.0s/1m30.0s

running (0m27.0s), 39/69 VUs, 525 complete and 0 interrupted iterations
default   [  30% ] 39/69 VUs  0m27.0s/1m30.0s

running (0m28.0s), 41/69 VUs, 560 complete and 0 interrupted iterations
default   [  31% ] 41/69 VUs  0m28.0s/1m30.0s

running (0m29.0s), 43/69 VUs, 600 complete and 0 interrupted iterations
default   [  32% ] 43/69 VUs  0m29.0s/1m30.0s

running (0m30.0s), 45/69 VUs, 643 complete and 0 interrupted iterations
default   [  33% ] 45/69 VUs  0m30.0s/1m30.0s

running (0m30.9s), 46/69 VUs, 687 complete and 0 interrupted iterations
default   [  34% ] 46/69 VUs  0m31.0s/1m30.0s

running (0m31.9s), 46/69 VUs, 730 complete and 0 interrupted iterations
default   [  36% ] 46/69 VUs  0m32.0s/1m30.0s

running (0m32.9s), 46/69 VUs, 776 complete and 0 interrupted iterations
default   [  37% ] 46/69 VUs  0m33.0s/1m30.0s

running (0m33.9s), 46/69 VUs, 822 complete and 0 interrupted iterations
default   [  38% ] 46/69 VUs  0m34.0s/1m30.0s

running (0m34.9s), 46/69 VUs, 868 complete and 0 interrupted iterations
default   [  39% ] 46/69 VUs  0m35.0s/1m30.0s

running (0m35.9s), 46/69 VUs, 911 complete and 0 interrupted iterations
default   [  40% ] 46/69 VUs  0m36.0s/1m30.0s

running (0m36.9s), 46/69 VUs, 957 complete and 0 interrupted iterations
default   [  41% ] 46/69 VUs  0m37.0s/1m30.0s

running (0m37.9s), 46/69 VUs, 1003 complete and 0 interrupted iterations
default   [  42% ] 46/69 VUs  0m38.0s/1m30.0s

running (0m38.9s), 46/69 VUs, 1049 complete and 0 interrupted iterations
default   [  43% ] 46/69 VUs  0m39.0s/1m30.0s

running (0m39.9s), 46/69 VUs, 1092 complete and 0 interrupted iterations
default   [  44% ] 46/69 VUs  0m40.0s/1m30.0s

running (0m40.9s), 47/69 VUs, 1138 complete and 0 interrupted iterations
default   [  46% ] 47/69 VUs  0m41.0s/1m30.0s

running (0m41.9s), 48/69 VUs, 1185 complete and 0 interrupted iterations
default   [  47% ] 48/69 VUs  0m42.0s/1m30.0s

running (0m42.9s), 49/69 VUs, 1233 complete and 0 interrupted iterations
default   [  48% ] 49/69 VUs  0m43.0s/1m30.0s

running (0m43.9s), 50/69 VUs, 1280 complete and 0 interrupted iterations
default   [  49% ] 50/69 VUs  0m44.0s/1m30.0s

running (0m44.9s), 51/69 VUs, 1329 complete and 0 interrupted iterations
default   [  50% ] 51/69 VUs  0m45.0s/1m30.0s

running (0m45.9s), 52/69 VUs, 1378 complete and 0 interrupted iterations
default   [  51% ] 52/69 VUs  0m46.0s/1m30.0s

running (0m46.9s), 53/69 VUs, 1424 complete and 0 interrupted iterations
default   [  52% ] 53/69 VUs  0m47.0s/1m30.0s

running (0m47.9s), 54/69 VUs, 1476 complete and 0 interrupted iterations
default   [  53% ] 54/69 VUs  0m48.0s/1m30.0s

running (0m48.9s), 55/69 VUs, 1525 complete and 0 interrupted iterations
default   [  54% ] 55/69 VUs  0m49.0s/1m30.0s

running (0m49.9s), 56/69 VUs, 1580 complete and 0 interrupted iterations
default   [  56% ] 56/69 VUs  0m50.0s/1m30.0s

running (0m50.9s), 57/69 VUs, 1636 complete and 0 interrupted iterations
default   [  57% ] 57/69 VUs  0m51.0s/1m30.0s

running (0m51.9s), 57/69 VUs, 1693 complete and 0 interrupted iterations
default   [  58% ] 57/69 VUs  0m52.0s/1m30.0s

running (0m52.9s), 57/69 VUs, 1750 complete and 0 interrupted iterations
default   [  59% ] 57/69 VUs  0m53.0s/1m30.0s

running (0m53.9s), 57/69 VUs, 1804 complete and 0 interrupted iterations
default   [  60% ] 57/69 VUs  0m54.0s/1m30.0s

running (0m54.9s), 57/69 VUs, 1860 complete and 0 interrupted iterations
default   [  61% ] 57/69 VUs  0m55.0s/1m30.0s

running (0m55.9s), 57/69 VUs, 1917 complete and 0 interrupted iterations
default   [  62% ] 57/69 VUs  0m56.0s/1m30.0s

running (0m56.9s), 57/69 VUs, 1971 complete and 0 interrupted iterations
default   [  63% ] 57/69 VUs  0m57.0s/1m30.0s

running (0m57.9s), 57/69 VUs, 2025 complete and 0 interrupted iterations
default   [  64% ] 57/69 VUs  0m58.0s/1m30.0s

running (0m58.9s), 57/69 VUs, 2082 complete and 0 interrupted iterations
default   [  66% ] 57/69 VUs  0m59.0s/1m30.0s

running (0m59.9s), 57/69 VUs, 2139 complete and 0 interrupted iterations
default   [  67% ] 57/69 VUs  1m00.0s/1m30.0s

running (1m00.9s), 58/69 VUs, 2195 complete and 0 interrupted iterations
default   [  68% ] 58/69 VUs  1m01.0s/1m30.0s

running (1m01.9s), 59/69 VUs, 2251 complete and 0 interrupted iterations
default   [  69% ] 59/69 VUs  1m02.0s/1m30.0s

running (1m02.9s), 60/69 VUs, 2305 complete and 0 interrupted iterations
default   [  70% ] 60/69 VUs  1m03.0s/1m30.0s

running (1m03.9s), 61/69 VUs, 2362 complete and 0 interrupted iterations
default   [  71% ] 61/69 VUs  1m04.0s/1m30.0s

running (1m04.9s), 62/69 VUs, 2421 complete and 0 interrupted iterations
default   [  72% ] 62/69 VUs  1m05.0s/1m30.0s

running (1m05.9s), 64/69 VUs, 2481 complete and 0 interrupted iterations
default   [  73% ] 64/69 VUs  1m06.0s/1m30.0s

running (1m06.9s), 65/69 VUs, 2542 complete and 0 interrupted iterations
default   [  74% ] 65/69 VUs  1m07.0s/1m30.0s

running (1m07.9s), 66/69 VUs, 2606 complete and 0 interrupted iterations
default   [  76% ] 66/69 VUs  1m08.0s/1m30.0s

running (1m08.9s), 67/69 VUs, 2672 complete and 0 interrupted iterations
default   [  77% ] 67/69 VUs  1m09.0s/1m30.0s

running (1m09.9s), 68/69 VUs, 2739 complete and 0 interrupted iterations
default   [  78% ] 68/69 VUs  1m10.0s/1m30.0s

running (1m10.9s), 69/69 VUs, 2804 complete and 0 interrupted iterations
default   [  79% ] 69/69 VUs  1m11.0s/1m30.0s

running (1m11.9s), 69/69 VUs, 2871 complete and 0 interrupted iterations
default   [  80% ] 69/69 VUs  1m12.0s/1m30.0s

running (1m12.9s), 69/69 VUs, 2939 complete and 0 interrupted iterations
default   [  81% ] 69/69 VUs  1m13.0s/1m30.0s

running (1m13.9s), 69/69 VUs, 3004 complete and 0 interrupted iterations
default   [  82% ] 69/69 VUs  1m14.0s/1m30.0s

running (1m14.9s), 69/69 VUs, 3072 complete and 0 interrupted iterations
default   [  83% ] 69/69 VUs  1m15.0s/1m30.0s

running (1m15.9s), 69/69 VUs, 3138 complete and 0 interrupted iterations
default   [  84% ] 69/69 VUs  1m16.0s/1m30.0s

running (1m16.9s), 69/69 VUs, 3203 complete and 0 interrupted iterations
default   [  86% ] 69/69 VUs  1m17.0s/1m30.0s

running (1m17.9s), 69/69 VUs, 3269 complete and 0 interrupted iterations
default   [  87% ] 69/69 VUs  1m18.0s/1m30.0s

running (1m18.9s), 69/69 VUs, 3337 complete and 0 interrupted iterations
default   [  88% ] 69/69 VUs  1m19.0s/1m30.0s

running (1m19.9s), 69/69 VUs, 3405 complete and 0 interrupted iterations
default   [  89% ] 69/69 VUs  1m20.0s/1m30.0s

running (1m20.9s), 64/69 VUs, 3472 complete and 0 interrupted iterations
default   [  90% ] 64/69 VUs  1m21.0s/1m30.0s

running (1m21.9s), 59/69 VUs, 3536 complete and 0 interrupted iterations
default   [  91% ] 59/69 VUs  1m22.0s/1m30.0s

running (1m22.9s), 55/69 VUs, 3592 complete and 0 interrupted iterations
default   [  92% ] 55/69 VUs  1m23.0s/1m30.0s

running (1m23.9s), 47/69 VUs, 3647 complete and 0 interrupted iterations
default   [  93% ] 47/69 VUs  1m24.0s/1m30.0s

running (1m24.9s), 39/69 VUs, 3693 complete and 0 interrupted iterations
default   [  94% ] 39/69 VUs  1m25.0s/1m30.0s

running (1m25.9s), 32/69 VUs, 3731 complete and 0 interrupted iterations
default   [  96% ] 32/69 VUs  1m26.0s/1m30.0s

running (1m26.9s), 25/69 VUs, 3763 complete and 0 interrupted iterations
default   [  97% ] 25/69 VUs  1m27.0s/1m30.0s

running (1m27.9s), 17/69 VUs, 3788 complete and 0 interrupted iterations
default   [  98% ] 17/69 VUs  1m28.0s/1m30.0s

running (1m28.9s), 11/69 VUs, 3805 complete and 0 interrupted iterations
default   [  99% ] 11/69 VUs  1m29.0s/1m30.0s

running (1m29.9s), 04/69 VUs, 3816 complete and 0 interrupted iterations
default   [ 100% ] 04/69 VUs  1m30.0s/1m30.0s

running (1m30.6s), 00/69 VUs, 3820 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/69 VUs  1m30s

     ✓ logged in
     ✓ got profile

     checks.........................: 100.00% ✓ 7640      ✗ 0
     data_received..................: 1.9 MB  22 kB/s
     data_sent......................: 2.1 MB  23 kB/s
     http_req_blocked...............: avg=41.94µs  min=1.01µs  med=2.88µs   max=20.52ms  p(90)=5.86µs  p(95)=8.16µs
     http_req_connecting............: avg=34.76µs  min=0s      med=0s       max=12.32ms  p(90)=0s      p(95)=0s
   ✓ http_req_duration..............: avg=13.27ms  min=96.05µs med=11.57ms  max=194.97ms p(90)=17.67ms p(95)=21.49ms
       { expected_response:true }...: avg=13.27ms  min=96.05µs med=11.57ms  max=194.97ms p(90)=17.67ms p(95)=21.49ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 7640
     http_req_receiving.............: avg=995.74µs min=21.85µs med=541.26µs max=185.38ms p(90)=1.11ms  p(95)=1.65ms
     http_req_sending...............: avg=20.07µs  min=5.19µs  med=13.18µs  max=954.54µs p(90)=41.36µs p(95)=56.09µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=12.26ms  min=0s      med=10.9ms   max=82.99ms  p(90)=16.12ms p(95)=19.59ms
     http_reqs......................: 7640    84.294764/s
     iteration_duration.............: avg=1.02s    min=1.01s   med=1.02s    max=1.2s     p(90)=1.03s   p(95)=1.04s
     iterations.....................: 3820    42.147382/s
     vus............................: 4       min=3       max=69
     vus_max........................: 69      min=69      max=69